CSI API ETABS v1
cPropFrame.GetTrapezoidal Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetTrapezoidal(
	string Name,
	ref string FileName,
	ref string MatProp,
	ref double T3,
	ref double T2,
	ref double T2b,
	ref int Color,
	ref string Notes,
	ref string GUID
)
Function GetTrapezoidal (
	Name As String,
	ByRef FileName As String,
	ByRef MatProp As String,
	ByRef T3 As Double,
	ByRef T2 As Double,
	ByRef T2b As Double,
	ByRef Color As Integer,
	ByRef Notes As String,
	ByRef GUID As String
) As Integer
Dim instance As cPropFrame
Dim Name As String
Dim FileName As String
Dim MatProp As String
Dim T3 As Double
Dim T2 As Double
Dim T2b As Double
Dim Color As Integer
Dim Notes As String
Dim GUID As String
Dim returnValue As Integer
returnValue = instance.GetTrapezoidal(Name,
	FileName, MatProp, T3, T2, T2b, Color,
	Notes, GUID)
int GetTrapezoidal(
	String^ Name,
	String^% FileName,
	String^% MatProp,
	double% T3,
	double% T2,
	double% T2b,
	int% Color,
	String^% Notes,
	String^% GUID
)
abstract GetTrapezoidal :
        Name : string *
        FileName : string byref *
        MatProp : string byref *
        T3 : float byref *
        T2 : float byref *
        T2b : float byref *
        Color : int byref *
        Notes : string byref *
        GUID : string byref -> int
Parameters
Name
Type: System.String
FileName
Type: System.String
MatProp
Type: System.String
T3
Type: System.Double
T2
Type: System.Double
T2b
Type: System.Double
Color
Type: System.Int32
Notes
Type: System.String
GUID
Type: System.String
Return Value
Type: Int32
See Also
Reference
cPropFrame Interface
ETABSv1 Namespace